tests/Data/PaypalAPI/create_plans_response.json

{
      "id": "ABCD-SERVER-GENERATED",
      "product_id": "ServerPRODUCT-42",
      "name": "ServerMonthly",
      "status": "CREATED",
      "billing_cycles": [
        {
          "tenure_type": "REGULAR",
          "sequence": 0,
          "total_cycles": 1,
          "pricing_scheme": {
            "version": 999,
            "pricing_model": "VOLUME",
            "tiers": [
              {
                "starting_quantity": null,
                "ending_quantity": null,
                "amount": null
              }
            ],
            "fixed_price": {
              "currency_code": "str",
              "value": "string"
            },
            "create_time": "string",
            "update_time": "string"
          },
          "frequency": {
            "interval_unit": "MONTH",
            "interval_count": 1
          }
        }
      ],
      "quantity_supported": false,
      "links": [
        {
          "href": "string",
          "rel": "string",
          "method": "GET"
        }
      ],
      "payment_preferences": {
        "auto_bill_outstanding": true,
        "setup_fee_failure_action": "CONTINUE",
        "payment_failure_threshold": 0,
        "setup_fee": {
          "currency_code": "str",
          "value": "string"
        }
      },
      "taxes": {
        "inclusive": true,
        "percentage": "string"
      },
      "create_time": "string",
      "update_time": "string"
    }
